
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy
  * module.pre_api[0].azurerm_api_management_product_api.link_to_product[0]
* Replace
  * module.pre_api[0].azurerm_api_management_api.api


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="https://pre-api.staging.platform.hmcts.net" />
                    <cors allow-credentials="false">
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                    </cors>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.pre_api[0].azurerm_api_management_api.api must be replaced
-/+ resource "azurerm_api_management_api" "api" {
      ~ id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/ss-stg-network-rg/providers/Microsoft.ApiManagement/service/sds-api-mgmt-stg/apis/pre-api;rev=52" -> (known after apply)
      ~ is_current            = true -> (known after apply)
      ~ is_online             = false -> (known after apply)
        name                  = "pre-api"
      ~ revision              = "52" -> "53" # forces replacement
      ~ soap_pass_through     = false -> (known after apply)
      + version               = (known after apply)
      + version_set_id        = (known after apply)
        # (8 unchanged attributes hidden)

      - subscription_key_parameter_names {
          - header = "Ocp-Apim-Subscription-Key" -> null
          - query  = "subscription-key" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.pre_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-stg-network-rg"
    }

Plan: 3 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":384,"Program":"tfcmt","SHA1":"","Vars":{}} -->